<a href="https://colab.research.google.com/github/BhuvneshSain/my-notebooks/blob/master/Assignment_2_1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import csv

# **Problem 1**

In [ ]:
df=pd.read_csv('Titanic.csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            463         0       1  ...  38.5000   E63         S
1            121         0       2  ...  73.5000   NaN         S
2            415         1       3  ...   7.9250   NaN         S
3            480         1       3  ...  12.2875   NaN         S
4            622         1       1  ...  52.5542   D19         S
..           ...       ...     ...  ...      ...   ...       ...
776          505         1       1  ...  86.5000   B79         S
777          776         0       3  ...   7.7500   NaN         S
778          111         0       1  ...  52.0000  C110         S
779          198         0       3  ...   8.4042   NaN         S
780          361         0       3  ...  27.9000   NaN         S

[781 rows x 12 columns]

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   781.000000  781.000000  781.000000  ...  781.000000  781.000000  781.000000
mean    445.335467    0.371319    2.309859  ...    0.503201    0.362356   30.312072
std     257.978890    0.483467    0.835904  ...    1.052008    0.796187   43.012711
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     221.000000    0.000000    2.000000  ...    0.000000    0.000000    7.895800
50%     443.000000    0.000000    3.000000  ...    0.000000    0.000000   14.108300
75%     671.000000    1.000000    3.000000  ...    1.000000    0.000000   30.500000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
def dec(X):
    return list(map(lambda x:'{0:.3f}'.format(x),X))

def sol(col):
    data=[df[col].mean(),df[col].median(),df[col].std()]
    return dec(data)

In [ ]:
output1=np.array([sol('Age'),sol('SibSp'),sol('Parch'),sol('Fare')])
output1=output1.reshape(12,1)
output1

array([[29.603],
       [28.   ],
       [14.427],
       [ 0.503],
       [ 0.   ],
       [ 1.052],
       [ 0.362],
       [ 0.   ],
       [ 0.796],
       [30.312],
       [14.108],
       [43.013]])

In [ ]:
perc=len(df[df['Survived']==1])/len(df)*100
diff=df[df['Pclass']==1]['Age'].mean()-df[df['Pclass']==3]['Age'].mean()
output2=[dec([perc]),dec([diff])]
output2

[['37.132'], ['12.727']]

12.727283730158728

In [ ]:
with open("output1.csv", "w") as out:
    writer = csv.writer(out, delimiter=",")
    writer.writerows(output1)

with open("output2.csv", "w") as out:
    writer = csv.writer(out, delimiter=",")
    writer.writerows(output2)

# **Problem 5**

In [ ]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/Ong0rz98dgXBwx3PkPJbkO5pR/drug_overdose.csv')
col='death_by_heroin'
no=2
df

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
0   1999                 784             1960                         730
1   2000                 986             1842                         782
2   2001                1456             1779                         957
3   2002                2358             2089                        1295
4   2003                2972             2080                        1400
5   2004                3845             1878                        1664
6   2005                4460             2009                        1742
7   2006                5406             2088                        2707
8   2007                5518             2399                        2213
9   2008                4924             3041                        2306
10  2009                4696             3278                        2946
11  2010                4577             3036                        3007
12  2011                4418             4397                        2666
13  2012                3932             5925                        2628
14  2013                3591             8257                        3105
15  2014                3400            10574                        5544
16  2015                3301            12989                        9580
17  2016                3373            15469                       19413
18  2017                3194            15482                       28466

In [ ]:
def sol(x):
    return np.percentile(df[col],x)

In [ ]:
grp1=df[df[col]>sol(95)]
grp1

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
18  2017                3194            15482                       28466

In [ ]:
grp2=df[(df[col]<=sol(95)) & (df[col]>sol(80))]
grp2

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
15  2014                3400            10574                        5544
16  2015                3301            12989                        9580
17  2016                3373            15469                       19413

In [ ]:
grp3=df[(df[col]<=sol(80)) & (df[col]>sol(50))]
grp3

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
9   2008                4924             3041                        2306
10  2009                4696             3278                        2946
12  2011                4418             4397                        2666
13  2012                3932             5925                        2628
14  2013                3591             8257                        3105

In [ ]:
grp4=df[df[col]<sol(50)]
grp4

   year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
0  1999                 784             1960                         730
1  2000                 986             1842                         782
2  2001                1456             1779                         957
3  2002                2358             2089                        1295
4  2003                2972             2080                        1400
5  2004                3845             1878                        1664
6  2005                4460             2009                        1742
7  2006                5406             2088                        2707
8  2007                5518             2399                        2213

In [ ]:
list(grp2['year'])

[2014, 2015, 2016]

# **Problem 4**

In [ ]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/N9rLGZvLx4M8pMnLBxv2o9ezv/US_Employment_Data.csv')
df

    year  population  labor_force  ...  unemployed_percent  not_in_labor  footnotes
0   1941       99900        55910  ...                 9.9         43990        NaN
1   1942       98640        56410  ...                 4.7         42230        NaN
2   1943       94640        55540  ...                 1.9         39100        NaN
3   1944       93220        54630  ...                 1.2         38590        NaN
4   1945       94090        53860  ...                 1.9         40230        NaN
..   ...         ...          ...  ...                 ...           ...        ...
66  2006      228815       151428  ...                 4.6         77387        1.0
67  2007      231867       153124  ...                 4.6         78743        1.0
68  2008      233788       154287  ...                 5.8         79501        1.0
69  2009      235801       154142  ...                 9.3         81659        1.0
70  2010      237830       153889  ...                 9.6         83941        1.0

[71 rows x 12 columns]

In [ ]:
col='labor_force'